sachin-johny/kernel_legacy_sprd_3.10.y/drivers/net/wireless/rtl8723as/os_dep/linux/ioctl_linux.c
	wrqu->length = strlen(extra) + 1;
	return 0;
}

static int rtw_mp_ant_rx(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u8 i;
	u16 antenna = 0;
	u8 		input[wrqu->length];
	PADAPTER padapter = rtw_netdev_priv(dev);

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
			return -EFAULT;
	//DBG_871X("%s: input=%s\n", __func__, input);

	for (i=0; i < strlen(input); i++) {

	switch( input[i] )
			{
				case 'a' :
								antenna|=ANTENNA_A;
								break;
				case 'b':
								antenna|=ANTENNA_B;
								break;
			}
	}

	//DBG_871X("%s: antenna=0x%x\n", __func__, antenna);
	padapter->mppriv.antenna_rx = antenna;
	//DBG_871X("%s:mppriv.antenna_rx=%d\n", __func__, padapter->mppriv.antenna_rx);
	Hal_SetAntenna(padapter);
	wrqu->length = strlen(extra) + 1;

	return 0;
}

static int rtw_mp_ctx(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u32 pkTx = 1, countPkTx = 1, cotuTx = 1, CarrSprTx = 1, scTx = 1, sgleTx = 1, stop = 1;
	u32 bStartTest = 1;
	u32 count = 0;
	struct mp_priv *pmp_priv;
	struct pkt_attrib *pattrib;

	PADAPTER padapter = rtw_netdev_priv(dev);


	pmp_priv = &padapter->mppriv;

	if (copy_from_user(extra, wrqu->pointer, wrqu->length))
			return -EFAULT;

	DBG_871X("%s: in=%s\n", __func__, extra);

	countPkTx = strncmp(extra, "count=", 6); // strncmp TRUE is 0
	cotuTx = strncmp(extra, "background", 20);
	CarrSprTx = strncmp(extra, "background,cs", 20);
	scTx = strncmp(extra, "background,sc", 20);
	sgleTx = strncmp(extra, "background,stone", 20);
	pkTx = strncmp(extra, "background,pkt", 20);
	stop = strncmp(extra, "stop", 5);
	sscanf(extra, "count=%d,pkt", &count);

	//just send one packet
	//if (countPkTx == 0 && count == 1) {
	//	DBG_8192C("%s Just Send One Packet\n", __func__);
	//	pmp_priv->tx.stop = 0;
	//	pmp_priv->tx.count = 1;
	//	pmp_priv->tx.payload = 2;
	//	pattrib = &pmp_priv->tx.attrib;
	//	pattrib->pktlen = 1000; //Set TX len=1000 for Robert test.
	//	_rtw_memset(pattrib->dst, 0xFF, ETH_ALEN);
	//	SetPacketTx(padapter);
	//	rtw_msleep_os(10); //delay 5ms for sending pkt before exit adb shell operation
	//	return 0;
	//}
	//DBG_871X("%s: count=%d countPkTx=%d cotuTx=%d CarrSprTx=%d pkTx=%d sgleTx=%d scTx=%d stop=%d\n", __func__, count, countPkTx, cotuTx, CarrSprTx, pkTx, sgleTx, scTx, stop);
	_rtw_memset(extra, '\0', sizeof(extra));

	if (stop == 0) {
		bStartTest = 0; // To set Stop
		pmp_priv->tx.stop = 1;
		switch (pmp_priv->lastmode)
		{
			case MP_SINGLE_TONE_TX:
		        Hal_SetSingleToneTx(padapter, (u8)bStartTest);
				sprintf( extra, "Stop Single Tone Tx");
				break;
			case MP_CONTINUOUS_TX:
		        Hal_SetContinuousTx(padapter, (u8)bStartTest);
				sprintf( extra, "Stop continuous Tx");
				break;
			case MP_CARRIER_SUPPRISSION_TX:
		        Hal_SetCarrierSuppressionTx(padapter, (u8)bStartTest);
				sprintf( extra, "Stop Carrier Suppression Tx");
				break;
			case MP_SINGLE_CARRIER_TX:
		        Hal_SetSingleCarrierTx(padapter, (u8)bStartTest);
				sprintf( extra, "Stop Single Carrier Tx");
				break;
		}
		pmp_priv->lastmode = MP_ON;
	} else {
		bStartTest = 1;
		if (pmp_priv->mode != MP_ON) {
			if (pmp_priv->tx.stop != 1) {
				DBG_871X("%s: MP_MODE != ON %d\n", __func__, pmp_priv->mode);
				return  -EFAULT;
			}
		}
	}

	if (sgleTx == 0)
	{
		pmp_priv->mode = MP_SINGLE_TONE_TX;
		pmp_priv->lastmode = MP_SINGLE_TONE_TX;
	}
	if (cotuTx == 0)
	{
		pmp_priv->mode = MP_CONTINUOUS_TX;
		pmp_priv->lastmode = MP_CONTINUOUS_TX;
	}
	if (CarrSprTx == 0)
	{
		pmp_priv->mode = MP_CARRIER_SUPPRISSION_TX;
		pmp_priv->lastmode = MP_CARRIER_SUPPRISSION_TX;
	}
	if (scTx == 0)
	{
		pmp_priv->mode = MP_SINGLE_CARRIER_TX;
		pmp_priv->lastmode = MP_SINGLE_CARRIER_TX;
	}
	if (pkTx == 0 || countPkTx == 0)
		pmp_priv->mode = MP_PACKET_TX;

	switch (pmp_priv->mode)
	{
		case MP_PACKET_TX:

			//DBG_871X("%s:pkTx %d\n", __func__,bStartTest);
			if (bStartTest == 0)
			{
				pmp_priv->tx.stop = 1;
				pmp_priv->mode = MP_ON;
				sprintf( extra, "Stop continuous Tx");
			}
			else if (pmp_priv->tx.stop == 1)
			{
				sprintf( extra, "Start continuous DA=ffffffffffff len=1000 count=%u,\n",count);
				//DBG_871X("%s:countPkTx %d\n", __func__,count);
				pmp_priv->tx.stop = 0;
				pmp_priv->tx.count = count;
				pmp_priv->tx.payload = 2;
				pattrib = &pmp_priv->tx.attrib;
				pattrib->pktlen = 1000; //Set TX len=1000 for Robert test.
				_rtw_memset(pattrib->dst, 0xFF, ETH_ALEN);
				SetPacketTx(padapter);
			}
			else {
				//DBG_871X("%s: pkTx not stop\n", __func__);
				return -EFAULT;
			}
			rtw_msleep_os(5); //delay 5ms for sending pkt before exit adb shell operation
			wrqu->length = strlen(extra);
			return 0;

		case MP_SINGLE_TONE_TX:
			//DBG_871X("%s: sgleTx %d \n", __func__, bStartTest);
			//if (bStartTest != 0){
			sprintf( extra, "Start continuous DA=ffffffffffff len=1500 \n infinite=yes.");
			Hal_SetSingleToneTx(padapter, (u8)bStartTest);
			//}
			break;

		case MP_CONTINUOUS_TX:
			//DBG_871X("%s: cotuTx %d\n", __func__, bStartTest);
			//if (bStartTest != 0){
			sprintf( extra, "Start continuous DA=ffffffffffff len=1500 \n infinite=yes.");
           		Hal_SetContinuousTx(padapter, (u8)bStartTest);
           		 //}
			break;

		case MP_CARRIER_SUPPRISSION_TX:
			//DBG_871X("%s: CarrSprTx %d\n", __func__, bStartTest);
			//if (bStartTest != 0){
			if( pmp_priv->rateidx <= MPT_RATE_11M )
			{
				sprintf( extra, "Start continuous DA=ffffffffffff len=1500 \n infinite=yes.");
				Hal_SetCarrierSuppressionTx(padapter, (u8)bStartTest);
			}else
				sprintf( extra, "Specify carrier suppression but not CCK rate");
			//}
			break;

		case MP_SINGLE_CARRIER_TX:
			//DBG_871X("%s: scTx %d\n", __func__, bStartTest);
			//if (bStartTest != 0){
			sprintf( extra, "Start continuous DA=ffffffffffff len=1500 \n infinite=yes.");
			Hal_SetSingleCarrierTx(padapter, (u8)bStartTest);
			//}
			break;

		default:
			//DBG_871X("%s:No Match MP_MODE\n", __func__);
			sprintf( extra, "Error! Continuous-Tx is not on-going.");
			return -EFAULT;
	}

	if (bStartTest) {
		struct mp_priv *pmp_priv = &padapter->mppriv;
		if (pmp_priv->tx.stop == 0) {
			pmp_priv->tx.stop = 1;
			//DBG_871X("%s: pkt tx is running...\n", __func__);
			rtw_msleep_os(5);
		}
		pmp_priv->tx.stop = 0;
		pmp_priv->tx.count = 1;
		SetPacketTx(padapter);
	} else {
		pmp_priv->mode = MP_ON;
	}

