sachin-johny/kernel_legacy_sprd_3.10.y/drivers/net/wireless/rtl8723as/os_dep/linux/ioctl_linux.c
			DBG_871X("\n======= RF REG =======\n");
			if(( RF_1T2R == rf_type ) ||( RF_1T1R ==rf_type ))
				path_nums = 1;
			else
				path_nums = 2;

			for(path=0;path<path_nums;path++)
			{
#ifdef CONFIG_RTL8192D
			  for (i = 0; i < 0x50; i++)
#else
	   		 for (i = 0; i < 0x34; i++)
#endif
				{
					//value = PHY_QueryRFReg(padapter, (RF_RADIO_PATH_E)path,i, bMaskDWord);
					value = rtw_hal_read_rfreg(padapter, path, i, 0xffffffff);
					if(j%4==1)	DBG_871X("0x%02x ",i);
					DBG_871X(" 0x%08x ",value);
					if((j++)%4==0)	DBG_871X("\n");
				}
			}
	}
	return 0;
}

static int rtw_mp_phypara(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{

	PADAPTER padapter = rtw_netdev_priv(dev);
	char 	input[wrqu->length];
	u32		valxcap;

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
			return -EFAULT;

	DBG_871X("%s:iwpriv in=%s\n", __func__, input);

	sscanf(input, "xcap=%d", &valxcap);

	if (!IS_HARDWARE_TYPE_8192D(padapter))
			return 0;
#ifdef CONFIG_RTL8192D
	Hal_ProSetCrystalCap( padapter , valxcap );
#endif

	sprintf( extra, "Set xcap=%d",valxcap );
	wrqu->length = strlen(extra) + 1;

return 0;

}

static int rtw_mp_SetRFPath(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	char 	input[wrqu->data.length];
	u8		bMain=1,bTurnoff=1;

	if (copy_from_user(input, wrqu->data.pointer, wrqu->data.length))
			return -EFAULT;
	DBG_871X("%s:iwpriv in=%s\n", __func__, input);

	bMain = strncmp(input, "1", 2); // strncmp TRUE is 0
	bTurnoff = strncmp(input, "0", 3); // strncmp TRUE is 0

	if(bMain==0)
	{
		MP_PHY_SetRFPathSwitch(padapter,_TRUE);
		DBG_871X("%s:PHY_SetRFPathSwitch=TRUE\n", __func__);
	}
	else if(bTurnoff==0)
	{
		MP_PHY_SetRFPathSwitch(padapter,_FALSE);
		DBG_871X("%s:PHY_SetRFPathSwitch=FALSE\n", __func__);
	}

	return 0;
}

static int rtw_mp_QueryDrv(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	char	input[wrqu->data.length];
	u8		qAutoLoad=1;

	EEPROM_EFUSE_PRIV *pEEPROM = GET_EEPROM_EFUSE_PRIV(padapter);

	if (copy_from_user(input, wrqu->data.pointer, wrqu->data.length))
			return -EFAULT;
	DBG_871X("%s:iwpriv in=%s\n", __func__, input);

	qAutoLoad = strncmp(input, "autoload", 8); // strncmp TRUE is 0

	if(qAutoLoad==0)
	{
		DBG_871X("%s:qAutoLoad\n", __func__);

		if(pEEPROM->bautoload_fail_flag)
			sprintf(extra, "fail");
		else
	        sprintf(extra, "ok");
	}
		wrqu->data.length = strlen(extra) + 1;
	return 0;
}

/* update Tx AGC offset */
static int rtw_mp_antBdiff(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{


	// MPT_ProSetTxAGCOffset
	return 0;
}


#ifdef CONFIG_RTL8723A

/* update Tx AGC offset */
static int rtw_mp_SetBT(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	BT_REQ_CMD 	BtReq;
	PMPT_CONTEXT	pMptCtx=&(padapter->mppriv.MptCtx);
	PBT_RSP_CMD 	pBtRsp=(PBT_RSP_CMD)&pMptCtx->mptOutBuf[0];
	char 	input[128];
	char *pch, *ptmp, *token, *tmp[2]={0x00,0x00};
	u8 setdata[100];

	u16 testmode=1,ready=1,trxparam=1,setgen=1,getgen=1,testctrl=1;
	u32 i,ii,jj,kk,cnts,status;

	if (copy_from_user(extra, wrqu->data.pointer, wrqu->data.length))
			return -EFAULT;
	if(strlen(extra)<1) return -EFAULT;

	DBG_871X("%s:iwpriv in=%s\n", __func__, extra);
	ready = strncmp(extra, "ready", 5);
	testmode = strncmp(extra, "testmode", 8); // strncmp TRUE is 0
	trxparam = strncmp(extra, "trxparam", 8);
	setgen = strncmp(extra, "setgen", 6);
	getgen = strncmp(extra, "getgen", 6);
	testctrl = strncmp(extra, "testctrl", 8);

	if ( strncmp(extra, "dlfw", 4) == 0)
	{
		status = rtl8723a_FirmwareDownload(padapter);
		if(status==_SUCCESS)
		{
		DBG_871X("%s: download FW %s\n", __func__, (_FAIL==status) ? "FAIL!":"OK.");
		sprintf(extra, "download FW %s", (_FAIL==status) ? "FAIL!":"OK.");
		wrqu->data.length = strlen(extra) + 1;
		}
		goto exit;
	}

	if( ready==0 )
	{
		BtReq.opCodeVer=1;
		BtReq.OpCode=0;
		BtReq.paraLength=1;
		goto todo;
	}

	DBG_871X("%s:after strncmp\n", __func__);
    pch = extra;
	i = 0;
	while ((token = strsep(&pch, ",")) != NULL)
	{
		if (i > 1) break;
		tmp[i] = token;
		i++;
	}

	if ((tmp[0]==NULL) && (tmp[1]==NULL))
	{
		return -EFAULT;
	}
	else
	{
	cnts = strlen(tmp[1]);
	if (cnts<1) return -EFAULT;

	DBG_871X("%s: cnts=%d\n", __FUNCTION__, cnts);
		DBG_871X("%s: data=%s\n", __FUNCTION__, tmp[1]);

	for (jj=0, kk=0; jj<cnts; jj++, kk+=2)
	{
				BtReq.pParamStart[jj] = key_2char2num(tmp[1][kk], tmp[1][kk+1]);
		}
	}

	if( testmode==0 )
	{
		BtReq.opCodeVer=1;
		BtReq.OpCode=1;
		BtReq.paraLength=1;
	}
	if( trxparam==0 )
	{
		BtReq.opCodeVer=1;
		BtReq.OpCode=2;
		BtReq.paraLength=1;
	}
	if( setgen==0 )
	{
		DBG_871X("%s: BT_SET_GENERAL \n", __func__);
		BtReq.opCodeVer=1;
		BtReq.OpCode=3; //BT_SET_GENERAL	3
		BtReq.paraLength=cnts/2;
	}
	if( getgen==0 )
	{
		DBG_871X("%s: BT_GET_GENERAL \n", __func__);
		BtReq.opCodeVer=1;
		BtReq.OpCode=4;		//BT_GET_GENERAL	3
		BtReq.paraLength=cnts/2;
	}
	if( testctrl==0 )
	{
		DBG_871X("%s: BT_TEST_CTRL \n", __func__);
		BtReq.opCodeVer=1;
		BtReq.OpCode=5; //BT_TEST_CTRL	5
		BtReq.paraLength=cnts/2;
	}

	for(i=0;i<BtReq.paraLength;i++)
	{
				DBG_871X("%s: BtReq.pParamStart[ %d ] = 0x%02x \n", __func__,i,BtReq.pParamStart[i]);
	}

	DBG_871X("%s: BtReq.paraLength =%d\n", __FUNCTION__, BtReq.paraLength);

	DBG_871X("opCodeVer=%d,OpCode=%d \n",BtReq.opCodeVer,BtReq.OpCode);

todo:
	_rtw_memset(extra,'\0', wrqu->data.length);

	mptbt_BtControlProcess(padapter,&BtReq);

	for (i=4; i<pMptCtx->mptOutLen; i++)
	{
		DBG_8192C("0x%x ", pMptCtx->mptOutBuf[i]);
		sprintf(extra, "%s 0x%x ", extra, pMptCtx->mptOutBuf[i]);
	}

exit:
	wrqu->data.length = strlen(extra) + 1;

return status;

}

#endif //#ifdef CONFIG_RTL8723A


static int rtw_mp_txpower_index(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	char input[wrqu->length];
	u32 rfpath;
	u32 txpower_inx;

	if (wrqu->length > 128)
		return -EFAULT;

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
		return -EFAULT;

	rfpath = rtw_atoi(input);
	txpower_inx = mpt_ProQueryCalTxPower(padapter, rfpath);
	sprintf(extra, " %d", txpower_inx);
	wrqu->length = strlen(extra) + 1;

