sachin-johny/kernel_legacy_sprd_3.10.y/drivers/net/wireless/rtl8723as/os_dep/linux/ioctl_linux.c
	return 0;
}


static int rtw_mp_write_mac(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	struct mp_priv *pmppriv = (struct mp_priv *)(&(padapter->mppriv));
	struct pkt_attrib *pattrib;
	char input[wrqu->length];
	char mac[6];
	char *pch, *pnext;
	u32 i;

	if (wrqu->length > 128)
		return -EFAULT;

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
		return -EFAULT;

	pch = input;
	for (i = 0; i < 5; i++) {
		pnext = strpbrk(pch, ":");
		if (!pnext)
			break;

		*pnext = 0;
		mac[i] = rtw_atoi(pch);
		pch = pnext + 1;
	}
	mac[5] = rtw_atoi(pch);

	pattrib = &pmppriv->tx.attrib;
	_rtw_memcpy(pattrib->src, mac, 6);
	_rtw_memcpy(padapter->eeprompriv.mac_addr, mac, 6);

	return 0;
}


static int rtw_mp_read_mac(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	char mac[6];

	_rtw_memcpy(mac, padapter->eeprompriv.mac_addr, ETH_ALEN);

	sprintf(extra, "%02x:%02x:%02x:%02x:%02x:%02x",
			mac[0], mac[1], mac[2],mac[3],mac[4],mac[5]);
	wrqu->length = strlen(extra) + 1;

	return 0;
}


static int rtw_mp_set_preamble(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	struct mp_priv *pmppriv = (struct mp_priv *)(&(padapter->mppriv));
	char input[wrqu->length];

	if (wrqu->length > 128)
		return -EFAULT;

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
		return -EFAULT;

	pmppriv->preamble = rtw_atoi(input);

	if (pmppriv->preamble == Long_Preamble || pmppriv->preamble == Long_GI)
		pmppriv->preamble = 0;
	else
		pmppriv->preamble = 1;

	return 0;
}


static int rtw_mp_get_device_id(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	char buffer[304];
	PRT_SDIO_ID_INFO pSdioIdInfo = (PRT_SDIO_ID_INFO)buffer;

	_rtw_memset(buffer, 0, 304);

	// Fill up member of RT_DEVICE_ID_HEADER.
	pSdioIdInfo->DevIDHeader.RtWlanDevTag = RT_DEVICE_ID_INFO_TAG;

	pSdioIdInfo->DevIDHeader.ChipID = 0x8723;
	pSdioIdInfo->DevIDHeader.ChipVer = 3; // 3 IS sdio 4 IS spi
	pSdioIdInfo->DevIDHeader.BusType = RT_DEVICE_ID_SDIO;

	//
	// <Roger_TODO> We should fill up the member of RT_SDIO_ID_INFO.
	// 2011.01.12.
	//
	pSdioIdInfo->VID = 0x024c;
	pSdioIdInfo->PID = 0x8723;
	pSdioIdInfo->RevID = 0;
	pSdioIdInfo->InterfaceIdx = 0;

	_rtw_memcpy(extra, buffer, sizeof(PRT_SDIO_ID_INFO));
	wrqu->length = strlen(extra) + 1;

	return 0;
}


static int rtw_mp_set_tx_agc(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	char input[wrqu->length];
	u32 tx_agc_offset;

	if (wrqu->length > 128)
		return -EFAULT;

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
		return -EFAULT;

	tx_agc_offset = rtw_atoi(input);

#ifdef MP_TODO
	// Set tx AGC Offset.
	if(!mpt_ProSetTxAGCOffset(padapter, ulTxAGCOffset))
	{
		Status = NDIS_STATUS_NOT_ACCEPTED;
	}
#endif

	return 0;

}


static int rtw_mp_autoload_status(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u32 autoload;

	autoload = 1;
	sprintf(extra, " %d", autoload);
	wrqu->length = strlen(extra) + 1;

	return 0;
}


static int rtw_mp_eeprom_type(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	u32 eeprom_type;

	// 1 93C46
	// 2 93C56
	// 3 For E-Fuse. added by Roger, 2008.11.10.
	eeprom_type = 3;
	sprintf(extra, " %d", eeprom_type);
	wrqu->length = strlen(extra) + 1;

	return 0;
}


static int rtw_mp_get_tssi(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	RT_TRACE(_module_mp_, _drv_info_,("rtw_mp_get_tssi has not supported yet."));

	return 0;
}


static int rtw_mp_efuse_utilize(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	u32 ulInfo = 0;

	char *pch;
	u8 type=0;

	if (copy_from_user(extra, wrqu->pointer, wrqu->length))
		return -EFAULT;
	pch = extra;
	DBG_871X("%s: in=%s\n", __func__, extra);

	if(strcmp(extra,"wifi") == 0 )
	{
		type = 0;
		padapter->HalFunc.GetHwRegHandler(padapter, HW_VAR_EFUSE_USAGE, (u8 *)&ulInfo);
	}
	else if (strcmp(extra,"bt") == 0){
#ifdef HAL_EFUSE_MEMORY
		PHAL_DATA_TYPE pHalData;
		pHalData = GET_HAL_DATA(padapter);
		BTEfuseUsedBytes = pHalData->EfuseHal.BTEfuseUsedBytes;
#endif
		u8 BTEfuseUsedPercentage = (BTEfuseUsedBytes/EFUSE_BT_REAL_CONTENT_LEN)*100;
		ulInfo = (BTEfuseUsedPercentage<<16)|(BTEfuseUsedBytes);
	}
	else
	{
		sprintf(extra, " wrong parameter");
		wrqu->length = strlen(extra) + 1;
		return 0;
	}

	//padapter->HalFunc.GetHwRegHandler(padapter, HW_VAR_EFUSE_USAGE, (u8 *)&ulInfo);

	sprintf(extra, " %d", ulInfo);
	wrqu->length = strlen(extra) + 1;

	return 0;
}


static int rtw_mp_disable_bt_coexist(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	char input[wrqu->length];
	u32 bt_coexist;

	if (wrqu->length > 128)
		return -EFAULT;

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
		return -EFAULT;

	bt_coexist = rtw_atoi(input);

	if( bt_coexist== 0 )
	{
		RT_TRACE(_module_mp_, _drv_info_,
			("Set OID_RT_SET_DISABLE_BT_COEXIST: disable\n"));
		//BT_SetManualControl(pAdapter, TRUE);
	}
	else
	{
		RT_TRACE(_module_mp_, _drv_info_,
			("Set OID_RT_SET_DISABLE_BT_COEXIST: enable\n"));
		//BT_SetManualControl(pAdapter, FALSE);
	}

	return 0;
}


static int rtw_mp_set_bt_nav(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	RT_MEDIA_STATUS	mstatus=RT_MEDIA_DISCONNECT;
	char input[wrqu->length];
	u32 bt_nav;

	if (wrqu->length > 128)
		return -EFAULT;

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
		return -EFAULT;

