sachin-johny/kernel_legacy_sprd_3.10.y/drivers/net/wireless/rtl8723as/os_dep/linux/ioctl_linux.c
	bt_nav = rtw_atoi(input);

	if(bt_nav == 0 )
	{
		mstatus=RT_MEDIA_DISCONNECT;
		padapter->HalFunc.SetHwRegHandler(padapter, HW_VAR_H2C_FW_JOINBSSRPT, (u8 *)(&mstatus));
		RT_TRACE(_module_mp_, _drv_info_,("Set OID_RT_SET_BT_NAV: Disconnected\n"));
	}
	else
	{
		mstatus=RT_MEDIA_CONNECT;
		padapter->HalFunc.GetHwRegHandler(padapter, HW_VAR_H2C_FW_JOINBSSRPT, (u8 *)(&mstatus));
		RT_TRACE(_module_mp_, _drv_info_,("Set OID_RT_SET_BT_NAV: Connected\n"));
	}

	return 0;
}


static int rtw_mp_bt_set_frag(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	char input[wrqu->length];
	u32 frag_len;

	if (wrqu->length > 128)
		return -EFAULT;

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
		return -EFAULT;

	frag_len = rtw_atoi(input);
	if (frag_len > 1500) {
		padapter->xmitpriv.frag_len = MAX_FRAG_THRESHOLD;
#ifdef MP_TODO
		padapter->registrypriv.disable_txsc = 0;
#endif
	} else {
		padapter->xmitpriv.frag_len = frag_len;
#ifdef MP_TODO
		padapter->registrypriv.disable_txsc = 1;
#endif
	}

	return 0;
}

#ifdef CONFIG_RTL8723A
extern void SetFwBTPwrCmd(IN PADAPTER Adapter, IN u1Byte	PwrIdx);
extern int FirmwareDownloadBT(IN PADAPTER Adapter, PRT_FIRMWARE_8723A pFirmware);
static int rtw_mp_set_h2c_cmd(struct net_device *dev,
			struct iw_request_info *info,
			struct iw_point *wrqu, char *extra)
{
	PADAPTER padapter = rtw_netdev_priv(dev);
	struct pwrctrl_priv *pwrpriv = &padapter->pwrctrlpriv;
	char input[wrqu->length];
	u8	CommandID;
	u8	H2C_Parameter[5] ={0};
	u32	be_success = _TRUE;
	u8	pchar,cnts,tmp[6],jj,setdata[6],kk;
	u32 i;

	if (wrqu->length > 128)
		return -EFAULT;

	if (copy_from_user(input, wrqu->pointer, wrqu->length))
		return -EFAULT;

	cnts = strlen( input )/2;
	if ( cnts == 0) return -EFAULT;

	DBG_871X("cnts = %d wrqu->length:%d \n" ,cnts,wrqu->length);
	DBG_871X("target data = %s \n" ,input);

	for( jj = 0, kk = 0; jj < cnts; jj++, kk += 2 )
	{
		setdata[jj] = key_2char2num( input[kk], input[kk+ 1] );
	}

	CommandID = setdata[0];

	for (i=0; i<5; i++) {
		H2C_Parameter[i] = setdata[i+1];//rtw_atoi(&pchar);
	}

	RT_TRACE(_module_mp_, _drv_notice_,("Set OID_RT_SET_H2C_COMMAND: CommandID=0x%x,"
			"H2C_Parameter[0]/[1]/[2]/[3]/[4]=0x%x/ 0x%x/ 0x%x/ 0x%x/ 0x%x\n",
			CommandID, H2C_Parameter[0], H2C_Parameter[1],
			H2C_Parameter[2], H2C_Parameter[3],H2C_Parameter[4]));
	DBG_8192C("Set OID_RT_SET_H2C_COMMAND: CommandID=0x%x,"
			"H2C_Parameter[0]/[1]/[2]/[3]/[4]=0x%x/ 0x%x/ 0x%x/ 0x%x/ 0x%x\n",
			CommandID, H2C_Parameter[0], H2C_Parameter[1],
			H2C_Parameter[2], H2C_Parameter[3],H2C_Parameter[4]);
#if 1
	if (CommandID == 0x50) {
		RT_TRACE(_module_mp_, _drv_info_,("&&&&&OID_RT_SET_H2C_COMMAND: CommandID == 0x50"));
#if 0
//#ifdef CONFIG_LPS
		if(H2C_Parameter[0] == 0x01) {
			pwrpriv->FwLPSLevel = H2C_Parameter[1];
			pwrpriv->SmartPs = H2C_Parameter[2];
			pwrpriv->FWCtrlPSMode = H2C_Parameter[3];

			RT_TRACE(_module_mp_, _drv_info_,("&&&&&OID_RT_SET_H2C_COMMAND: H2C_Parameter[0] == 0x01 lps level:%d (01:is 32k 02:is rf 03:is reg);"
					"SmartPs:%d FWCtrlPSMode:%d", pwrpriv->FwLPSLevel, pwrpriv->SmartPs, pwrpriv->FWCtrlPSMode));

			LeisurePSEnter(padapter);
		} else {
			RT_TRACE(_module_mp_, _drv_info_,("&&&&&OID_RT_SET_H2C_COMMAND: H2C_Parameter[0] != 0x01 lps level:%d (01:is 32k 02:is rf 03:is reg)",
					pwrpriv->FwLPSLevel));
			LeisurePSLeave(padapter);
		}
#endif
	} else if (CommandID == 0x55) {
		if(H2C_Parameter[0] == 0x01) {
			RT_TRACE(_module_mp_, _drv_info_,("&&&&&OID_RT_SET_H2C_COMMAND: H2C_Parameter[0] == 0x01 disable DM"));
#ifdef MP_TODO
			padapter->disable_bt_dm = 1;
#endif
		} else {
			RT_TRACE(_module_mp_, _drv_info_,("&&&&&OID_RT_SET_H2C_COMMAND: H2C_Parameter[0] == 0x00 enable DM"));
#ifdef MP_TODO
			padapter->disable_bt_dm = 0;
#endif
		}
	}
#ifdef CONFIG_MP_INCLUDED
	else if (CommandID == 0x60)
	{
		RT_TRACE(_module_mp_, _drv_notice_,("&&&&&OID_RT_SET_H2C_COMMAND: CommandID == 0x60"));
		RT_TRACE(_module_mp_, _drv_notice_,("&&&&&OID_RT_SET_H2C_COMMAND: H2C_Parameter[0] == %x (0x01 BTMP_Enter 0x00 is BTMP_Leave)",
				H2C_Parameter[0]));

		if (H2C_Parameter[0] == 0x01) {
			/* firmware bug:
			 * must run BTMP_Enter command twice,
			 * BT can only enter MP mode.
			 */
			if (!BT_MP_EnterOrLeave(padapter, 1)) {
				if (!BT_MP_EnterOrLeave(padapter, 1))
					be_success = _FAIL;
			}
		} else if (H2C_Parameter[0] == 0x00) {
			if (!BT_MP_EnterOrLeave(padapter, 0))
				be_success = _FAIL;

		} else {
				RT_TRACE(_module_mp_, _drv_info_,("&&&&&OID_RT_SET_H2C_COMMAND: CommandID == 0x60 BTMP H2C_Parameter wrong"));
		}
	}
	else if (CommandID == 0x80)
	{
		RT_TRACE(_module_mp_, _drv_info_,("&&&&&OID_RT_SET_H2C_COMMAND: CommandID == 0x80 BT PWR:%d", H2C_Parameter[0]));
		SetFwBTPwrCmd(padapter, H2C_Parameter[0]);

	}
#endif
	else
	{
		FillH2CCmd(padapter, CommandID, 5, H2C_Parameter);
	}
#endif
exit:
	sprintf(extra, " %d", be_success);
	wrqu->length = strlen(extra) + 1;

	return 0;
}
#endif //CONFIG_RTL8723A

static int rtw_mp_set(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wdata, char *extra)
{
	struct iw_point *wrqu = (struct iw_point *)wdata;
	u32 subcmd = wrqu->flags;
	PADAPTER padapter = rtw_netdev_priv(dev);

	DBG_871X("in mp_set extra= %s \n",extra);

	if (padapter == NULL)
	{
		return -ENETDOWN;
	}

	//_rtw_memset(extra, 0x00, IW_PRIV_SIZE_MASK);

	if (extra == NULL)
	{
		wrqu->length = 0;
		return -EIO;
	}

	switch(subcmd)
	{
	case WRITE_REG :
			DBG_871X("set case write_reg \n");
			rtw_mp_write_reg (dev,info,wrqu,extra);
			 break;

	case WRITE_RF:
			DBG_871X("set case write_rf \n");
			rtw_mp_write_rf (dev,info,wrqu,extra);
			 break;

	case MP_START:
			DBG_871X("set case mp_start \n");
			rtw_mp_start (dev,info,wrqu,extra);
			 break;

	case MP_STOP:
			DBG_871X("set case mp_stop \n");
			rtw_mp_stop (dev,info,wrqu,extra);
			 break;

	case MP_BANDWIDTH:
			DBG_871X("set case mp_bandwidth \n");
			rtw_mp_bandwidth (dev,info,wrqu,extra);
			break;
	case MP_PWRTRK:
			DBG_871X("set case MP_PWRTRK \n");
			rtw_mp_pwrtrk (dev,info,wrqu,extra);
			break;

	case MP_RESET_STATS:
			DBG_871X("set case MP_RESET_STATS \n");
			rtw_mp_reset_stats	(dev,info,wrqu,extra);
			break;

	case EFUSE_SET:
			DBG_871X("set case EFUSE_SET \n");
			rtw_mp_efuse_set (dev,info,wdata,extra);
		break;

	case MP_WRITE_MAC:
		 	DBG_871X("set case MP_WRITE_MAC \n");
			rtw_mp_write_mac (dev,info,wrqu,extra);
		break;

