sachin-johny/kernel_legacy_sprd_3.10.y/drivers/net/wireless/rtl8723as/os_dep/linux/ioctl_linux.c
	case MP_SET_PREAMBLE:
			DBG_871X("set case MP_SET_PREAMBLE \n");
			rtw_mp_set_preamble (dev,info,wrqu,extra);
		break;

	case MP_SET_TX_AGC:
			DBG_871X("set case MP_SET_TX_AGC \n");
			rtw_mp_set_tx_agc (dev,info,wrqu,extra);
		break;

	case MP_DISABLE_BT_COEXIST:
			DBG_871X("set case MP_DISABLE_BT_COEXIST \n");
			rtw_mp_disable_bt_coexist (dev,info,wrqu,extra);
		break;

	case MP_SET_BT_NAV:
			DBG_871X("set case MP_SET_BT_NAV \n");
			rtw_mp_set_bt_nav (dev,info,wrqu,extra);
		break;

	case MP_BT_SET_FRAG:
			DBG_871X("set case MP_BT_SET_FRAG \n");
			rtw_mp_bt_set_frag (dev,info,wrqu,extra);
		break;

	case MP_SetRFPathSwh:
			DBG_871X("set MP_SetRFPathSwitch \n");
			rtw_mp_SetRFPath  (dev,info,wdata,extra);
			break;

	}

	rtw_msleep_os(10); //delay 5ms for sending pkt before exit adb shell operation

	return 0;
}


static int rtw_mp_get(struct net_device *dev,
			struct iw_request_info *info,
			union iwreq_data *wdata, char *extra)
{
	struct iw_point *wrqu = (struct iw_point *)wdata;
	u32 subcmd = wrqu->flags;
	PADAPTER padapter = rtw_netdev_priv(dev);

	//DBG_871X("in mp_get extra= %s \n",extra);

	if (padapter == NULL)
	{
		return -ENETDOWN;
	}
	if (extra == NULL)
	{
		wrqu->length = 0;
		return -EIO;
	}

	switch(subcmd)
	{
	case MP_PHYPARA:
			DBG_871X("mp_get  MP_PHYPARA \n");
			rtw_mp_phypara(dev,info,wrqu,extra);
			break;

	case MP_CHANNEL:
			DBG_871X("mp_get mp_channel \n");
			rtw_mp_channel (dev,info,wrqu,extra);
			break;

	case READ_REG:
			DBG_871X("mp_get  READ_REG \n");
			rtw_mp_read_reg (dev,info,wrqu,extra);
			 break;
	case READ_RF:
			DBG_871X("mp_get  READ_RF \n");
			rtw_mp_read_rf (dev,info,wrqu,extra);
			break;

	case MP_RATE:
			DBG_871X("mp_get case mp_rate \n");
			rtw_mp_rate (dev,info,wrqu,extra);
			break;

	case MP_TXPOWER:
			DBG_871X("mp_get case MP_TXPOWER \n");
			rtw_mp_txpower (dev,info,wrqu,extra);
			break;

	case MP_ANT_TX:
			DBG_871X("mp_get case MP_ANT_TX \n");
			rtw_mp_ant_tx (dev,info,wrqu,extra);
			break;

	case MP_ANT_RX:
			DBG_871X("mp_get case MP_ANT_RX \n");
			rtw_mp_ant_rx (dev,info,wrqu,extra);
			break;

	case MP_QUERY:
			//DBG_871X("mp_get mp_query MP_QUERY \n");
			rtw_mp_trx_query(dev,info,wrqu,extra);
			break;

	case MP_CTX:
			DBG_871X("mp_get case MP_CTX \n");
			rtw_mp_ctx (dev,info,wrqu,extra);
			break;

	case MP_ARX:
			DBG_871X("mp_get case MP_ARX \n");
			rtw_mp_arx (dev,info,wrqu,extra);
			break;

	case EFUSE_GET:
			DBG_871X("mp_get EFUSE_GET \n");
			rtw_mp_efuse_get(dev,info,wdata,extra);
		 break;

	case MP_DUMP:
			DBG_871X("mp_get case MP_DUMP \n");
			rtw_mp_dump (dev,info,wrqu,extra);
		 break;
	case MP_PSD:
			DBG_871X("mp_get case MP_PSD \n");
			rtw_mp_psd (dev,info,wrqu,extra);
		 break;

	case MP_THER:
			DBG_871X("mp_get case MP_THER \n");
			rtw_mp_thermal (dev,info,wrqu,extra);
		break;

	case MP_QueryDrvStats:
			DBG_871X("mp_get MP_QueryDrvStats \n");
			rtw_mp_QueryDrv  (dev,info,wdata,extra);
			break;

	case MP_GET_TXPOWER_INX:
			DBG_871X("mp_get MP_GET_TXPOWER_INX \n");
			rtw_mp_txpower_index (dev,info,wrqu,extra);
		break;

	case MP_RAED_MAC:
			DBG_871X("mp_get MP_RAED_MAC \n");
			rtw_mp_read_mac (dev,info,wrqu,extra);
		break;

	case MP_DEVICE_ID:
			DBG_871X("mp_get MP_DEVICE_ID \n");
			rtw_mp_get_device_id (dev,info,wrqu,extra);
		break;

	case MP_AUTOLOAD_STATUS:
			DBG_871X("mp_get MP_AUTOLOAD_STATUS \n");
			rtw_mp_autoload_status (dev,info,wrqu,extra);
		break;

	case MP_EEPROM_TYPE:
			DBG_871X("mp_get MP_EEPROM_TYPE \n");
			rtw_mp_eeprom_type (dev,info,wrqu,extra);
		break;

	case MP_TSSI:
			DBG_871X("mp_get MP_TSSI \n");
			rtw_mp_get_tssi (dev,info,wrqu,extra);
		break;

	case MP_EFUSE_UTILIZE:
			DBG_871X("mp_get MP_EFUSE_UTILIZE \n");
			rtw_mp_efuse_utilize (dev,info,wrqu,extra);
		break;

#ifdef CONFIG_RTL8723A
	case MP_SET_H2C_CMD:
			DBG_871X("mp_get MP_SET_H2C_CMD \n");
			rtw_mp_set_h2c_cmd (dev,info,wrqu,extra);
		break;
	case MP_SetBT:
			DBG_871X("set MP_SetBT \n");
			rtw_mp_SetBT  (dev,info,wdata,extra);
			break;
#endif

	}

	rtw_msleep_os(10); //delay 5ms for sending pkt before exit adb shell operation
return 0;
}

#endif //#if defined(CONFIG_MP_INCLUDED) && defined(CONFIG_MP_IWPRIV_SUPPORT)



static int rtw_tdls_setup(struct net_device *dev,
				struct iw_request_info *info,
				union iwreq_data *wrqu, char *extra)
{
	int ret = 0;

#ifdef CONFIG_TDLS

	u8 i, j;
	_adapter *padapter = (_adapter *)rtw_netdev_priv(dev);
	u8 mac_addr[ETH_ALEN];

	DBG_871X( "[%s] %s %d\n", __FUNCTION__, extra, wrqu->data.length -1  );

	for( i=0, j=0 ; i < ETH_ALEN; i++, j+=3 ){
		mac_addr[i]=key_2char2num(*(extra+j), *(extra+j+1));
	}

	issue_tdls_setup_req(padapter, mac_addr);

#endif //CONFIG_TDLS

	return ret;
}


static int rtw_tdls_teardown(struct net_device *dev,
				struct iw_request_info *info,
				union iwreq_data *wrqu, char *extra)
{
	int ret = 0;

#ifdef CONFIG_TDLS

	u8 i,j;
	_adapter *padapter = (_adapter *)rtw_netdev_priv(dev);
	struct sta_info *ptdls_sta = NULL;
	u8 mac_addr[ETH_ALEN];

	DBG_871X( "[%s] %s %d\n", __FUNCTION__, extra, wrqu->data.length -1  );

	for( i=0, j=0 ; i < ETH_ALEN; i++, j+=3 ){
		mac_addr[i]=key_2char2num(*(extra+j), *(extra+j+1));
	}

	ptdls_sta = rtw_get_stainfo( &(padapter->stapriv), mac_addr);

	if(ptdls_sta != NULL)
	{
		ptdls_sta->stat_code = _RSON_TDLS_TEAR_UN_RSN_;
		issue_tdls_teardown(padapter, mac_addr);
	}

#endif //CONFIG_TDLS

	return ret;
}


static int rtw_tdls_discovery(struct net_device *dev,
				struct iw_request_info *info,
				union iwreq_data *wrqu, char *extra)
{
	int ret = 0;

#ifdef CONFIG_TDLS

	_adapter *padapter = (_adapter *)rtw_netdev_priv(dev);
	struct mlme_ext_priv	*pmlmeext = &(padapter->mlmeextpriv);
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);

	DBG_871X( "[%s] %s %d\n", __FUNCTION__, extra, wrqu->data.length -1  );

	issue_tdls_dis_req(padapter, NULL);

#endif //CONFIG_TDLS

	return ret;
}

static int rtw_tdls_ch_switch(struct net_device *dev,
				struct iw_request_info *info,
				union iwreq_data *wrqu, char *extra)
{
	int ret = 0;

#ifdef CONFIG_TDLS

	_adapter *padapter = (_adapter *)rtw_netdev_priv(dev);
	struct tdls_info	*ptdlsinfo = &padapter->tdlsinfo;
	u8 i, j, mac_addr[ETH_ALEN];
	struct sta_info *ptdls_sta = NULL;

	DBG_8192C( "[%s] %s %d\n", __FUNCTION__, extra, wrqu->data.length -1  );

	for( i=0, j=0 ; i < ETH_ALEN; i++, j+=3 ){
		mac_addr[i]=key_2char2num(*(extra+j), *(extra+j+1));
	}

